l10n_mx_facturae_pac_finkok/doc/cancel_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns3="uuid" xmlns:ns0="wis.soap.cancellation" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="wis.soap.cancel" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header/>
	<ns1:Body>
		<ns2:cancel>
			<ns2:UUIDS>
				<ns3:uuids>
					<ns0:string>6308DF45-0D7F-4060-9121-6C8639FE1C14</ns0:string>
				</ns3:uuids>
			</ns2:UUIDS>
			<ns2:username>username@finkok.com</ns2:username>
			<ns2:password>PassWord</ns2:password>
			<ns2:taxpayer_id>CSO050217EA1</ns2:taxpayer_id>
			<ns2:cer>LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV6RENDQTdTZ0F3SUJBZ0lVTURBd01ERXdN
REF3TURBeU1ERXlNek0zT1RZd0RRWUpLb1pJaHZjTkFRRUYKQlFBd2dnR1ZNVGd3TmdZRFZRUURE
QzlCTGtNdUlHUmxiQ0JUWlhKMmFXTnBieUJrWlNCQlpHMXBibWx6ZEhKaApZMm5EczI0Z1ZISnBZ
blYwWVhKcFlURXZNQzBHQTFVRUNnd21VMlZ5ZG1samFXOGdaR1VnUVdSdGFXNXBjM1J5CllXTnB3
N051SUZSeWFXSjFkR0Z5YVdFeE9EQTJCZ05WQkFzTUwwRmtiV2x1YVhOMGNtRmphY096YmlCa1pT
QlQKWldkMWNtbGtZV1FnWkdVZ2JHRWdTVzVtYjNKdFlXTnB3N051TVNFd0h3WUpLb1pJaHZjTkFR
a0JGaEpoYzJsegpibVYwUUhOaGRDNW5iMkl1YlhneEpqQWtCZ05WQkFrTUhVRjJMaUJJYVdSaGJH
ZHZJRGMzTENCRGIyd3VJRWQxClpYSnlaWEp2TVE0d0RBWURWUVFSREFVd05qTXdNREVMTUFrR0Ex
VUVCaE1DVFZneEdUQVhCZ05WQkFnTUVFUnAKYzNSeWFYUnZJRVpsWkdWeVlXd3hGREFTQmdOVkJB
Y01DME4xWVhWb2RNT3BiVzlqTVJVd0V3WURWUVF0RXd4VApRVlE1TnpBM01ERk9Uak14UGpBOEJn
a3Foa2lHOXcwQkNRSU1MMUpsYzNCdmJuTmhZbXhsT2lCRFpXTnBiR2xoCklFZDFhV3hzWlhKdGFX
NWhJRWRoY21QRHJXRWdSM1ZsY25KaE1CNFhEVEV5TURVek1URTNNelUwTjFvWERURTIKTURVek1U
RTNNelUwTjFvd2dnRU1NVG93T0FZRFZRUURFekZUUlZKV1NVTkpUMU1nUVVSTlNVNUpVMVJTUVZS
SgpWazlUSUZaQlRFeEpVMDlNUlZSQlRrOVRJRk5CSUVSRklFTldNVG93T0FZRFZRUXBFekZUUlZK
V1NVTkpUMU1nClFVUk5TVTVKVTFSU1FWUkpWazlUSUZaQlRFeEpVMDlNUlZSQlRrOVRJRk5CSUVS
RklFTldNVG93T0FZRFZRUUsKRXpGVFJWSldTVU5KVDFNZ1FVUk5TVTVKVTFSU1FWUkpWazlUSUZa
QlRFeEpVMDlNUlZSQlRrOVRJRk5CSUVSRgpJRU5XTVNVd0l3WURWUVF0RXh4VFFWWXhNakEwTVRC
U1FqQWdMeUJCUlZKQk9EUXdOakV4UmpnNE1SNHdIQVlEClZRUUZFeFVnTHlCQlJWSkJPRFF3TmpF
eFNGTk1Va1JPTURreER6QU5CZ05WQkFzVEJrMUJWRkpKV2pDQm56QU4KQmdrcWhraUc5dzBCQVFF
RkFBT0JqUUF3Z1lrQ2dZRUExSUpmNU1TZkk1UFVSU3Z4MTdWenBhTFUrSVZXRUI0QwpPN2lpNHhQ
R0xBbThYMFptV2FwVjI0Q21GanBGVVFoNElNS04wZ1ltdmtJMUJaSG1uR3g3YlpxUW5Wb09jZWFm
CjBkSFJQc2hVMWxiT212b1k5OW93SlBBMFdQNXJvWGZyR09sOEg5QVN5NitucTlOUWlYaGVBT2FW
ZHJUbWVQQWYKY29lT0dTcGJPQXNDQXdFQUFhTWRNQnN3REFZRFZSMFRBUUgvQkFJd0FEQUxCZ05W
SFE4RUJBTUNCc0F3RFFZSgpLb1pJaHZjTkFRRUZCUUFEZ2dFQkFCOG9LMlNvTVB1dWY2amxrZ3hD
cXdKZC9hN2hmcHAxMENFaDJMbThsWm1qCjJTSmpKS0ovWERyZEpydGRxeEloUGFKSWtNTUtVWGlr
REJyNXZOTGV6aXBhZ0pkZTFzTi9kaVl1SmlpWHRSbFgKMFlZa2w5WlBuNGkvNUY4OTI3WXcxbTI0
YXgyRmNtanpFa0hkSGVjRk5STFV5OFAzeVB5YVAzckwxRWRLcnNTbwpjNGtocjhhb0dJTkI4MERu
TFFJYktLcEtCL2E5Nm5uemt0WWE4S1R5NjVpOVJJWE5EZWZZU25hZ2c0UEFCSjhCCnRPSGtJOHBl
clhvOFZjbkxwaHR0ZlNuRzZjQmZ4KzdFaWFkN1YrREJqQ0JzUVpSUHgrUks5bUNsMkdYZXhkd2EK
d2VQalMzbkN3QWJ4bk9xQjFoWWZVcHJvczBob1htdlJ3aTMrQzRSVkZzaz0KLS0tLS1FTkQgQ0VS
VElGSUNBVEUtLS0tLQo=
			</ns2:cer>
			<ns2:key>LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpQcm9jLVR5cGU6IDQsRU5DUllQVEVECkRF
Sy1JbmZvOiBERVMtRURFMy1DQkMsMkI5NTg4NDM2QkYxNDRFQQoKZTVQRzBJc2ROY2FFY1NPczBJ
b3R0TzluSmd1REthSzFJeFcyRDJ5UXppMm0zYlNONG1ROTdSSSt3TjlVV3FRYwpUeHFxVEoxSHht
eW5pZFZPVjRxZmVRWlo0cHJJSVhwUEJOU1luM2U4dWIvUVNJNEx2T2MwQjlaK1pBVEVHcGZsCnVF
QTBTa1VOelkzZ2prNzlVN1RxazF6aW5oVlZ2VkNDVmFoMEpjN1kzcEMxSDYrS2FZbFRGSWpZOUVU
dTI4LzcKaXlwSWdyS0NYVjg4azZqMVhwWFY4SFo2UDBEcmFQU1pWcGg2SUc0aFdWRFB0MklsUjQ3
cEZSRGhRVmZQbEU0RQo4bFpKMG1kNDFqNCs3UHl3OTZoRXNhTDVEVUtHb0RIWlBtdVlTYk9XeXFy
M2xraldkbnpKdnpDaFdrSlNPYTY0CnR1TVNValBWci9hcEZ5SjBmY1Q4WXZTcWFHanp3WjBFN1Q1
L3Y1WEEwTTdFNHk5V1UrWTd1djVrdHVSYXl5NXoKbEdvYUllTm1qYm1Kd3FEUzU0R2IxZEJCVHFo
OFFxVHp6SUU5VU9xTzczYlFwRE0zdlN2a2tWYU15WUpXeGYybgo1ZUIwTThQRXlrb0I4VEhQYzB2
MXNPWTFNUTUvTCtpZmt5eFpuK3pJdmNNTWpFSkRiVEhpa0JqUHozbFZ3MU9RCkJMV0s5MmxaZ3lB
Y0lEWjVNbUpMZHdxSHliMWpnblA2eGR2alViVzNOTHM2eVpQUFloSGtpYjRYM2Eyc2dBeUoKOHB3
TDdwWHVuNHdQeXJKc0hOZENnYVNUckpxR2hieUg0cHIyejVjdTJqWEYzYUY4OE5oUk1IZlp4Y1Qx
Q25zRAptbEJ4d3ZLZ3V1QmVZemp6Sk1uWnZYM0RlUzZFTGFmbDM2WDI2QzQ5ZU5BTEtaN215NmNm
MVo1MnA0cWVaeEduCkoyVVhGRHJtenE1cmRBaXExQldWTHdoelNhR3ZXL0lyVCtlVUtpZkI0Mm1h
a1hiSnQyejF5SDl1YTNER1JvclYKazZ5NFh1T0J3ZmMyazgrL0Zld2ZvK0xWWi9pWkVkUUlVeUxY
UHRrZWhlbz0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
			</ns2:key>
		</ns2:cancel>
	</ns1:Body>
</SOAP-ENV:Envelope>
